app/controllers/api/v1/teams_controller.rb

    def index
      @teams = Team.all()
---
SELECT "teams".* FROM "teams"